#+TITLE: Cali Coffee Company Production Optimisation

* Code
#+begin_src python :results output
from scipy import optimize
import scipy
import numpy as np

A = np.matrix([[0.2, 0.35, 0.1],
               [0.4, 0.15, 0.35],
               [0.15, 0.2, 0.4],
               [0.25, 0.3, 0.15]])

c = np.array([0.6, 0.8, 0.55, 0.7])

p = np.array([2.25, 2.5, 2.4])

objective = -(p.T - c.T @ A)

A_ub = np.matrix([[0.2, 0.35, 0.1], # Abundo usage
                  [0.4, 0.15, 0.35], # Colmado usage
                  [0.15, 0.2, 0.4], # Maximo usage
                  [0.25, 0.3, 0.15], # Saboro usage
                  [1, 1 , 1], # Total production
                  [-1, 0, 0], # Hotel
                  [0, -1, 0], # Restaurant
                  [0, 0, -1]]) # Market

b_ub = np.array([40000, # Abundo availability
                 25000, # Colmado availability
                 20000, # Maximo availability
                 45000, # Saboro availability
                 100000, # Maximum production
                 -10000, # Min Hotel
                 -25000, # Min Restaurant
                 -30000]) # Min Market

primal_result = optimize.linprog(objective, A_ub, b_ub)
print('RESULTS OF PRIMAL LP')
print(f'Optimal assignment: {list(map(round, primal_result.x))}')
print(f'Maximum value: {round(primal_result.fun)}')
print(f'Slack values: {list(map(round, primal_result.slack))}')

print()

dual_objective = b_ub.T
dual_A_ub = -A_ub.T
dual_b_ub = objective.T

dual_result = optimize.linprog(dual_objective, dual_A_ub, dual_b_ub)
print('RESULTS OF DUAL LP')
print(f'Optimal assignment: {list(map(round, dual_result.x))}')
print(f'Maximum value: {round(dual_result.fun)}')
print(f'Slack values: {list(map(round, dual_result.slack))}')


#+end_src

#+RESULTS:
: RESULTS OF PRIMAL LP
: Optimal assignment: [20000, 25000, 30000]
: Maximum value: -129350
: Slack values: [24250, 2750, 0, 28000, 25000, 10000, 0, 0]
:
: RESULTS OF DUAL LP
: Optimal assignment: [0, 0, 10, 0, 0, 0, 0, 2]
: Maximum value: 129350
: Slack values: [0, 0, 0]

